In [1]:
import pandas as pd 
import numpy as np 
import seaborn as sns 
from scipy import stats 
import matplotlib.pyplot as plt
from empiricaldist import Pmf , Cdf
from matplotlib.ticker import PercentFormatter

import warnings
warnings.filterwarnings("ignore")

In [2]:
fn_employment = pd.read_csv("fna02_employment_activity.csv")# fn = foreign nationals
fn_in_employment = pd.read_csv("fna08_foreign_nationals_in_employment.csv")

## EDA

In [24]:
print(fn_in_employment.dtypes)
print(f"\n COUNT is :\n",fn_in_employment.count() )

Statistic Label                object
Broad Nationality Group        object
Sex                            object
Industry Sector NACE Rev 2     object
Year                            int64
UNIT                           object
VALUE                         float64
dtype: object

 Count is :
 Statistic Label               6762
Broad Nationality Group       6762
Sex                           6762
Industry Sector NACE Rev 2    6762
Year                          6762
UNIT                          6762
VALUE                         6401
dtype: int64

In [8]:
fn_employment.dtypes

Statistic Label             object
Broad Nationality Group     object
Year of Entry               object
Year                         int64
UNIT                        object
VALUE                      float64
dtype: object

In [3]:
fn_employment.head()

,Statistic Label,Broad Nationality Group,Year of Entry,Year,UNIT,VALUE
0,Employment Activity of Foreign Nationals,All nationalities,All PPSN allocations to foreign nationals aged...,2002,Number,76919.0
1,Employment Activity of Foreign Nationals,All nationalities,All PPSN allocations to foreign nationals aged...,2003,Number,70138.0
2,Employment Activity of Foreign Nationals,All nationalities,All PPSN allocations to foreign nationals aged...,2004,Number,114750.0
3,Employment Activity of Foreign Nationals,All nationalities,All PPSN allocations to foreign nationals aged...,2005,Number,168197.0
4,Employment Activity of Foreign Nationals,All nationalities,All PPSN allocations to foreign nationals aged...,2006,Number,200450.0

In [4]:
fn_in_employment.head()

,Statistic Label,Broad Nationality Group,Sex,Industry Sector NACE Rev 2,Year,UNIT,VALUE
0,Foreign Nationals in Employment,All nationalities,Both sexes,"Agriculture, forestry and fishing (A)",2005,Number,5116.0
1,Foreign Nationals in Employment,All nationalities,Both sexes,"Agriculture, forestry and fishing (A)",2006,Number,6032.0
2,Foreign Nationals in Employment,All nationalities,Both sexes,"Agriculture, forestry and fishing (A)",2007,Number,6705.0
3,Foreign Nationals in Employment,All nationalities,Both sexes,"Agriculture, forestry and fishing (A)",2008,Number,6863.0
4,Foreign Nationals in Employment,All nationalities,Both sexes,"Agriculture, forestry and fishing (A)",2009,Number,6154.0

In [5]:
fn_employment.describe()

             Year          VALUE
count  2499.00000    1370.000000
mean   2010.00000   10411.219708
std       4.89996   19218.666055
min    2002.00000       1.000000
25%    2006.00000     608.500000
50%    2010.00000    3551.000000
75%    2014.00000   10706.500000
max    2018.00000  200450.000000